---
kind: property
id: P:Autodesk.Revit.DB.Leader.IsValidObject
source: html/d25e8824-74c5-ad59-ba02-90f9024e8f38.htm
---
# Autodesk.Revit.DB.Leader.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.